#+TITLE: Mutiples of 3 or 5 
#+DATE: <2021-09-21 Tue>
#+AUTHOR: Salvador Guzman
#+EMAIL: guzmansalv@gmail.com
#+OPTIONS: text:t
#+CATEGORY: Math
#+CATEGORY: Article
#+CATEGORY: Problem
#+CATEGORY: ProjectEuler
#+LANGUAGE: en

***** Computational Approach
     An algorithm flavored approach would involve running a for loop from 1 to
     100 and summing those numbers that are multiples of either 3 or 5. There is
     a small gotcha where depending on the particular implementation of the
     algorithm, you might sum an integer doubly; all you would do in this
     scenario is substract out the double. 

     In python, the solution is as simple as this,
     #+NAME: sum-python
     #+BEGIN_SRC python
         sum: int = 0
         for n in range(1000):
             if n % 3 == 0 or n % 5 == 0:
                 sum += n

         return sum
     #+END_SRC

     #+RESULTS: sum-python
     : 233168

     There you go! There's your answer! Of corse, I am more interested in a
     mathematical solution so let's keep going. But we know that our basic
     presupposition concerning the topology of the solution is correct. The
     problem statement demands a line and that line must be queried in order to
     accumulate a list of the members, in this case integers, that match the
     criteria of being multiples of 3 or 5. Now, what would the math based
     approach look like?

